app/Models/AccountModel.php

    public function getAdmin($id_account = false)
    {
        if ($id_account == false) {
            return $this
                ->select('account.*,nama_jabatan')
                ->join('jabatan as j', 'j.id_jabatan = account.id_jabatan')
                ->findAll();
---
SELECT `account`.*, `nama_jabatan`
FROM `account`
JOIN `jabatan` as `j` ON `j`.`id_jabatan` = `account`.`id_jabatan`

    public function getUser($id_account = false)
    {
        if ($id_account == false) {
            return $this
                ->select('account.*,nama_jabatan')
                ->join('jabatan as j', 'j.id_jabatan = account.id_jabatan')
                ->where(['j.level' => '1'])
                ->findAll();
---
SELECT `account`.*, `nama_jabatan`
FROM `account`
JOIN `jabatan` as `j` ON `j`.`id_jabatan` = `account`.`id_jabatan`
WHERE `j`.`level` = '1'

    public function getNik($nik = false)
    {
        if ($nik == false) {
            return session()->setFlashdata('error', 'NIK Tidak Boleh Kosong.');
        }
        return $this
            ->select('account.*,nama_jabatan')
            ->join('jabatan as j', 'j.id_jabatan = account.id_jabatan')
            ->where(['nik' => $nik])
            ->first();
---
SELECT `account`.*, `nama_jabatan`, `level`
FROM `account`
JOIN `jabatan` as `j` ON `j`.`id_jabatan` = `account`.`id_jabatan`
WHERE `nik` = '1111111111111111'
 LIMIT 1