app/Models/PengajuanModel.php

SELECT `master_pengajuan`.*
FROM `master_pengajuan`
WHERE `status_pengajuan` = 'Selesai'
---
    public function getProsesPengajuan($status)
    {
        return $this
            ->select('master_pengajuan.*')
            ->where('status_pengajuan', $status)
            ->findAll();

SELECT `master_pengajuan`.*, `nik`, `nama_Lengkap`, `jenis_kelamin`, `tempat_Lahir`, `tanggal_Lahir`, `negara`, `agama`, `status`, `pekerjaan`, `alamat`, `spRT`, `ktp`, `kk`
FROM `master_pengajuan`
JOIN `surat_keterangan_ghaib` as `a` ON `a`.`id_SKGhaib` = `master_pengajuan`.`id_SKGhaib`
---
    public function getSuratGhaib($id_SKGhaib, $id_master_pengajuan = false)
    {
        if ($id_master_pengajuan == false) {
            return $this
                ->select('master_pengajuan.*,nik,nama_Lengkap,jenis_kelamin,tempat_Lahir,tanggal_Lahir,negara,agama,status,pekerjaan,alamat,spRT,ktp,kk')
                ->join('surat_keterangan_ghaib as a', 'a.id_SKGhaib = master_pengajuan.id_SKGhaib')
                ->findAll();